export const tones = [
    ['', 'ˉ'], // First deliberately left empty as first tone is default for bomofo
    ['ˊ', 'ˊ'],
    ['ˇ', 'ˇ'],
    ['ˋ', 'ˋ'],
    ['˙', '˙']
];

export const consonants = [
  ['ㄅ', 'b'],
  ['ㄆ', 'p'],
  ['ㄇ', 'm'],
  ['ㄈ', 'f'],
  ['ㄉ', 'd'],
  ['ㄊ', 't'],
  ['ㄋ', 'n'],
  ['ㄌ', 'l'],
  ['ㄍ', 'g'],
  ['ㄎ', 'k'],
  ['ㄏ', 'h'],
  ['ㄐ', 'j'],
  ['ㄑ', 'q'],
  ['ㄒ', 'x'],
  ['ㄓ', 'zh', 'zhi'],
  ['ㄔ', 'ch', 'chi'],
  ['ㄕ', 'sh', 'shi'],
  ['ㄖ', 'r', 'ri'],
  ['ㄗ', 'z', 'zi'],
  ['ㄘ', 'c', 'ci'],
  ['ㄙ', 's', 'si']
];
export const medials = [
    ['ㄚ', 'a'],
    ['ㄛ', 'o'],
    ['ㄜ', 'e'],
    ['ㄝ', 'ê'],
    ['ㄞ', 'ai'],
    ['ㄟ', 'ei'],
    ['ㄠ', 'ao'],
    ['ㄡ', 'ou'],
    ['ㄢ', 'an'],
    ['ㄣ', 'en'],
    ['ㄤ', 'ang'],
    ['ㄥ', 'eng'],
    ['ㄦ', 'er'],
    ['ㄧ', 'i', 'yi'],
    ['ㄨ', 'u', 'wu'],
    ['ㄩ', 'ü', 'yu'],
    ['ㄭ/ㄭ', 'i', 'i']
];
