export const tones = [
    ['', 'ˉ'], // First deliberately left empty as first tone is default for bomofo
    ['ˊ', 'ˊ'],
    ['ˇ', 'ˇ'],
    ['ˋ', 'ˋ'],
    ['˙', '˙']
];

export const consonants = [
  ['ㄅ', 'b'],
  ['ㄆ', 'p'],
  ['ㄇ', 'm'],
  ['ㄈ', 'f'],
  ['ㄉ', 'd'],
  ['ㄊ', 't'],
  ['ㄋ', 'n'],
  ['ㄌ', 'l'],
  ['ㄍ', 'g'],
  ['ㄎ', 'k'],
  ['ㄏ', 'h'],
  ['ㄐ', 'j'],
  ['ㄑ', 'q'],
  ['ㄒ', 'x'],
  ['ㄓ', 'zhi/zh-'],
  ['ㄔ', 'chi/ch-'],
  ['ㄕ', 'shi/sh-'],
  ['ㄖ', 'ri/r-'],
  ['ㄗ', 'zi/z-'],
  ['ㄘ', 'ci/c-'],
  ['ㄙ', 'si/s-']
];
export const medials = [
    ['ㄚ', 'a'],
    ['ㄛ', 'o'],
    ['ㄜ', 'e'],
    ['ㄝ', 'ê'],
    ['ㄞ', 'ai'],
    ['ㄟ', 'ei'],
    ['ㄠ', 'ao'],
    ['ㄡ', 'ou'],
    ['ㄢ', 'an'],
    ['ㄣ', 'en'],
    ['ㄤ', 'ang'],
    ['ㄥ', 'eng'],
    ['ㄦ', 'er'],
    ['ㄧ', 'yi/-i'],
    ['ㄨ', 'wu/-u'],
    ['ㄩ', 'yu/-ü'],
    ['ㄭ/ㄭ', '-i']
];
